esphome/esphome/esphome/components/wifi/wifi_component_esp8266.cpp
  WiFiMockClass::_event_callback(event);
}

bool WiFiComponent::wifi_apply_output_power_(float output_power) {
  uint8_t val = static_cast<uint8_t>(output_power * 4);
  system_phy_set_max_tpw(val);
  return true;
}
bool WiFiComponent::wifi_sta_pre_setup_() {
  if (!this->wifi_mode_(true, {}))
    return false;

  bool ret1, ret2;
  ETS_UART_INTR_DISABLE();
  ret1 = wifi_station_set_auto_connect(0);
  ret2 = wifi_station_set_reconnect_policy(false);
  ETS_UART_INTR_ENABLE();

  if (!ret1 || !ret2) {
    ESP_LOGV(TAG, "Disabling Auto-Connect failed");
  }

#ifdef USE_WIFI_PHY_MODE
  if (!this->wifi_apply_phy_mode_()) {
    ESP_LOGV(TAG, "Setting PHY Mode failed");
  }
#endif

  delay(10);
  return true;
}

#ifdef USE_WIFI_PHY_MODE
bool WiFiComponent::wifi_apply_phy_mode_() {
  if (this->phy_mode_ == WIFI_8266_PHY_MODE_AUTO)
    return true;
  // Values of WiFi8266PhyMode are aligned with the SDK's phy_mode_t enum.
  return wifi_set_phy_mode(static_cast<phy_mode_t>(this->phy_mode_));
}
#endif

void WiFiComponent::wifi_pre_setup_() {
  wifi_set_event_handler_cb(&WiFiComponent::wifi_event_callback);

  // Make sure WiFi is in clean state before anything starts
  this->wifi_mode_(false, false);
}

WiFiSTAConnectStatus WiFiComponent::wifi_sta_connect_status_() const {
  // Use cached state from wifi_event_callback() instead of calling
  // wifi_station_get_connect_status() which queries the SDK every time.
  // Use if statements with early returns instead of switch to avoid GCC
  // generating a CSWTCH lookup table in .rodata (flash) on ESP8266.
  auto state = static_cast<ESP8266WiFiSTAState>(this->sta_state_);
  if (state == ESP8266WiFiSTAState::CONNECTED)
    return WiFiSTAConnectStatus::CONNECTED;
  if (state == ESP8266WiFiSTAState::ERROR_NOT_FOUND)
    return WiFiSTAConnectStatus::ERROR_NETWORK_NOT_FOUND;
  if (state == ESP8266WiFiSTAState::ERROR_FAILED)
    return WiFiSTAConnectStatus::ERROR_CONNECT_FAILED;
  if (state == ESP8266WiFiSTAState::CONNECTING || state == ESP8266WiFiSTAState::ASSOCIATED)
    return WiFiSTAConnectStatus::CONNECTING;
  return WiFiSTAConnectStatus::IDLE;
}

bool WiFiComponent::wifi_scan_start_(bool passive) {
  // enable STA
  if (!this->wifi_mode_(true, {}))
    return false;

  // Reset scan_done_ before starting new scan to prevent stale flag from previous scan
  // (e.g., roaming scan completed just before unexpected disconnect)
  this->scan_done_ = false;

  struct scan_config config {};
  memset(&config, 0, sizeof(config));
  config.ssid = nullptr;
  config.bssid = nullptr;
  config.channel = 0;
  config.show_hidden = 1;
  config.scan_type = passive ? WIFI_SCAN_TYPE_PASSIVE : WIFI_SCAN_TYPE_ACTIVE;
  // Use shorter dwell times for roaming scans - we only need to detect strong
  // nearby APs, not do a thorough survey. This also reduces off-channel time
  // which can cause Beacon Timeout disconnects on some APs.
  // Roaming times match the ESP32 IDF scan defaults.
  static constexpr uint32_t SCAN_PASSIVE_DEFAULT_MS = 500;
  static constexpr uint32_t SCAN_PASSIVE_ROAMING_MS = 300;
  static constexpr uint32_t SCAN_ACTIVE_MIN_DEFAULT_MS = 400;
  static constexpr uint32_t SCAN_ACTIVE_MAX_DEFAULT_MS = 500;
  static constexpr uint32_t SCAN_ACTIVE_MIN_ROAMING_MS = 100;
  static constexpr uint32_t SCAN_ACTIVE_MAX_ROAMING_MS = 300;
  bool roaming = this->is_roaming_scan_active();
  if (passive) {
    config.scan_time.passive = roaming ? SCAN_PASSIVE_ROAMING_MS : SCAN_PASSIVE_DEFAULT_MS;
  } else {
    config.scan_time.active.min = roaming ? SCAN_ACTIVE_MIN_ROAMING_MS : SCAN_ACTIVE_MIN_DEFAULT_MS;
    config.scan_time.active.max = roaming ? SCAN_ACTIVE_MAX_ROAMING_MS : SCAN_ACTIVE_MAX_DEFAULT_MS;
  }
  bool ret = wifi_station_scan(&config, &WiFiComponent::s_wifi_scan_done_callback);
  if (!ret) {
    ESP_LOGV(TAG, "wifi_station_scan failed");
    return false;
  }

  return ret;
}
bool WiFiComponent::wifi_disconnect_() {
  bool ret = true;
  // Only call disconnect if interface is up
  if (wifi_get_opmode() & WIFI_STA) {
#if LWIP_VERSION_MAJOR != 1
    sta_netif_down();
#endif
    ret = wifi_station_disconnect();
  }
  station_config conf{};
  memset(&conf, 0, sizeof(conf));
  ETS_UART_INTR_DISABLE();
  wifi_station_set_config_current(&conf);
  ETS_UART_INTR_ENABLE();
  return ret;
}
void WiFiComponent::s_wifi_scan_done_callback(void *arg, STATUS status) {
  global_wifi_component->wifi_scan_done_callback_(arg, status);
}

void WiFiComponent::wifi_scan_done_callback_(void *arg, STATUS status) {
  // Compiles to nothing here; kept so every scan_result_ mutation holds the lock
  ScanResultsLock lock(this);
  this->scan_result_.clear();

  if (status != OK) {
    ESP_LOGV(TAG, "Scan failed: %d", status);
    // Don't call retry_connect() here - this callback runs in SDK system context
    // where yield() cannot be called. Instead, just set scan_done_ and let
    // check_scanning_finished() handle the empty scan_result_ from loop context.
    this->scan_done_ = true;
    return;
  }

  auto *head = reinterpret_cast<bss_info *>(arg);
  bool needs_full = this->needs_full_scan_results_();

  // First pass: count matching networks (linked list is non-destructive)
  size_t total = 0;
  size_t count = 0;
  for (bss_info *it = head; it != nullptr; it = STAILQ_NEXT(it, next)) {
    total++;
    const char *ssid_cstr = reinterpret_cast<const char *>(it->ssid);
    if (needs_full || this->matches_configured_network_(ssid_cstr, it->bssid)) {
      count++;
    }
  }

  if (!this->scan_result_.try_init(count)) {
    ESP_LOGW(TAG, "No memory for %zu scan results", count);
    this->scan_done_ = true;
    return;
  }

  // Second pass: store matching networks
  for (bss_info *it = head; it != nullptr; it = STAILQ_NEXT(it, next)) {
    const char *ssid_cstr = reinterpret_cast<const char *>(it->ssid);
    if (needs_full || this->matches_configured_network_(ssid_cstr, it->bssid)) {
      this->scan_result_.emplace_back(
          bssid_t{it->bssid[0], it->bssid[1], it->bssid[2], it->bssid[3], it->bssid[4], it->bssid[5]}, ssid_cstr,
          it->ssid_len, it->channel, it->rssi, it->authmode != AUTH_OPEN, it->is_hidden != 0);
    } else {
      this->log_discarded_scan_result_(ssid_cstr, it->bssid, it->rssi, it->channel);
    }
  }
  ESP_LOGV(TAG, "Scan complete: %zu found, %zu stored%s", total, this->scan_result_.size(),
           needs_full ? LOG_STR_LITERAL("") : LOG_STR_LITERAL(" (filtered)"));
  this->scan_done_ = true;
#ifdef USE_WIFI_SCAN_RESULTS_LISTENERS
  this->pending_.scan_complete = true;  // Defer listener callbacks to main loop
#endif
}

#ifdef USE_WIFI_AP
bool WiFiComponent::wifi_ap_ip_config_(const optional<ManualIP> &manual_ip) {
  // enable AP
  if (!this->wifi_mode_({}, true))
    return false;

  struct ip_info info {};
  if (manual_ip.has_value()) {
    info.ip = manual_ip->static_ip;
    info.gw = manual_ip->gateway;
    info.netmask = manual_ip->subnet;
  } else {
    info.ip = network::IPAddress(192, 168, 4, 1);
    info.gw = network::IPAddress(192, 168, 4, 1);
    info.netmask = network::IPAddress(255, 255, 255, 0);
  }

